# 01 - How to find the version

In [1]:
import pandas as pd
pd.__version__

'1.4.0'

In [2]:
# another way
pd.show_versions()

c:\Users\Quantum\AppData\Local\Programs\Python\Python39\lib\site-packages\setuptools\distutils_patch.py:25: UserWarning: Distutils was imported before Setuptools. This usage is discouraged and may exhibit undesirable behaviors or errors. Please use Setuptools' objects directly or at least import Setuptools first.
  warnings.warn(

INSTALLED VERSIONS
------------------
commit           : bb1f651536508cdfef8550f93ace7849b00046ee
python           : 3.9.4.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.19041
machine          : AMD64
processor        : Intel64 Family 6 Model 60 Stepping 3, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United States.1252

pandas           : 1.4.0
numpy            : 1.22.1
pytz             : 2021.3
dateutil         : 2.8.2
pip              : 20.2.3
setuptools       : 49.2.1
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.1
IPython          : 8.0.1
pandas_datareader: None
bs4              : 4.11.1
bottleneck       : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.5.1
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.0.10
pandas_gbq       : None
pyarrow          : 7.0.0
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.7.3
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None

# 02- Make a dataframe

In [3]:
df = pd.DataFrame({'A col': [1, 2, 3], 'B col' : [4, 5, 6]})
df

   A col  B col
0      1      4
1      2      5
2      3      6

In [4]:
# Numpy array use to creat dataframe
import numpy as np
arr = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
pd.DataFrame(arr)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
# Numpy array dataframe
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.059501,0.111931,0.545867,0.287528,0.583701,0.762144,0.726421,0.722669
1,0.589777,0.118378,0.105071,0.961709,0.956586,0.680863,0.426587,0.459797
2,0.033059,0.157524,0.096342,0.262562,0.985330,0.049388,0.951837,0.404928
3,0.915951,0.668712,0.656868,0.857960,0.740338,0.945442,0.252392,0.919213

In [6]:
pd.DataFrame(np.random.rand(4,8), columns=list('ABCDEFGH'))

,A,B,C,D,E,F,G,H
0,0.316722,0.891852,0.446202,0.114046,0.432687,0.449734,0.591802,0.958338
1,0.918307,0.274028,0.734804,0.597765,0.042556,0.404466,0.617810,0.325220
2,0.423909,0.932910,0.968373,0.451399,0.058951,0.676494,0.854517,0.637804
3,0.826402,0.641907,0.816856,0.402549,0.476741,0.356091,0.232713,0.593880

# How to rename columns?

In [7]:
df = pd.DataFrame({'A col': [1, 2, 3,6,5,6,8,9], 'B col' : [4, 5, 6,5,8,7,7,9]})
df

   A col  B col
0      1      4
1      2      5
2      3      6
3      6      5
4      5      8
5      6      7
6      8      7
7      9      9

In [8]:
df.rename(columns={'A col': 'col_A', 'B col': 'col_B'}, inplace=True)
df

   col_A  col_B
0      1      4
1      2      5
2      3      6
3      6      5
4      5      8
5      6      7
6      8      7
7      9      9

In [9]:
# remane columns
df.columns=['col_aa', 'col_bb']
df

   col_aa  col_bb
0       1       4
1       2       5
2       3       6
3       6       5
4       5       8
5       6       7
6       8       7
7       9       9

In [10]:
# to replace any character, string
df.columns=df.columns.str.replace('_', ' ')
df

   col aa  col bb
0       1       4
1       2       5
2       3       6
3       6       5
4       5       8
5       6       7
6       8       7
7       9       9

In [11]:
# Adding prefix to columns
df = df.add_prefix('ahsan')
df

   ahsancol aa  ahsancol bb
0            1            4
1            2            5
2            3            6
3            6            5
4            5            8
5            6            7
6            8            7
7            9            9

In [12]:
# adding suffix to col
df = df.add_suffix('_zaman')
df

   ahsancol aa_zaman  ahsancol bb_zaman
0                  1                  4
1                  2                  5
2                  3                  6
3                  6                  5
4                  5                  8
5                  6                  7
6                  8                  7
7                  9                  9

In [13]:
df.columns = ['col_a', 'col_b']
df

   col_a  col_b
0      1      4
1      2      5
2      3      6
3      6      5
4      5      8
5      6      7
6      8      7
7      9      9

# Using template data

In [14]:
import pandas as pd
import numpy as np
import seaborn as sns

ship = sns.load_dataset('titanic')
ship.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [15]:
# Summary
df.describe()

          col_a     col_b
count  8.000000  8.000000
mean   5.000000  6.375000
std    2.828427  1.685018
min    1.000000  4.000000
25%    2.750000  5.000000
50%    5.500000  6.500000
75%    6.500000  7.250000
max    9.000000  9.000000

In [16]:
# Columns name
ship.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [17]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\quantum\appdata\local\programs\python\python39\lib\site-packages (3.0.10)
Requirement already satisfied: et-xmlfile in c:\users\quantum\appdata\local\programs\python\python39\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 20.2.3; however, version 22.2.2 is available.
You should consider upgrading via the 'c:\Users\Quantum\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [18]:
# Saving datasets
ship.to_csv('ship.csv')
ship.to_excel('ship.xlsx')

# Using your own Data

In [19]:
import pandas as pd
df = pd.read_csv('ship.csv')
df.head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [20]:
df = pd.read_excel('ship.xlsx')
df.head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# Reverse row Order

In [21]:
import seaborn as sns
import pandas as pd

ship = sns.load_dataset('titanic')
df.head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [22]:
df.loc[::-1].head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [23]:
df.loc[::-1].reset_index(drop=True).head()

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

# Reverse Column Order

In [24]:
df.loc[:, ::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived,Unnamed: 0
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1,2
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1,3
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0,4

# Select a column by dtype

In [25]:
ship.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [26]:
# Only select those having Numaric type
ship.select_dtypes(include=['number']).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [27]:
# Only select those having Object type
ship.select_dtypes(include=['object']).head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [28]:
# Only select those having multiple type
ship.select_dtypes(include=['object','number', 'category']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,deck,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,Third,man,NaN,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,First,woman,C,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,NaN,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,First,woman,C,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,Third,man,NaN,Southampton,no

In [29]:
ship.select_dtypes(exclude=['object']).head()

,survived,pclass,age,sibsp,parch,fare,class,adult_male,deck,alone
0,0,3,22.0,1,0,7.2500,Third,True,NaN,False
1,1,1,38.0,1,0,71.2833,First,False,C,False
2,1,3,26.0,0,0,7.9250,Third,False,NaN,True
3,1,1,35.0,1,0,53.1000,First,False,C,False
4,0,3,35.0,0,0,8.0500,Third,True,NaN,True

# Convert Strings into Numbers

In [30]:
df = pd.DataFrame({'A col': ['1', '2', '3','6','5', '6', '8' ,'9'], 
                    'B col' : ['4', '5', '6' , '5' , '8', '7', '7', '9']})
df

  A col B col
0     1     4
1     2     5
2     3     6
3     6     5
4     5     8
5     6     7
6     8     7
7     9     9

In [31]:
df.dtypes

A col    object
B col    object
dtype: object

In [32]:
df.astype({'A col': 'float64', 'B col': 'int64'}).dtypes

A col    float64
B col      int64
dtype: object

In [33]:
pd.to_numeric(df['A col'], errors='coerce')

0    1
1    2
2    3
3    6
4    5
5    6
6    8
7    9
Name: A col, dtype: int64

# Reduce data frame size

In [34]:
df = sns.load_dataset('titanic')
df.shape

(891, 15)

In [35]:
df.sample(frac=0.1).shape

(89, 15)

# 11 Copy data from clipboard

In [36]:
# dataset download 
import seaborn as sns
import pandas as pd

df = sns.load_dataset('titanic')
df.to_excel('ship.xlsx')

In [37]:
# Read clipboard in python
df = pd.read_clipboard()
df

,fasla,=,"pd.DataFrame([['12345',","100,200,","300],","['34567',","400,","500,","600],","['67890',","700,","800,","900]],"
0,"columns=['zip',","'factory',","'warehouse',",'retail']),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,fasla.head(),None,None,None,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# 12- split Dataframe into two subsets

In [38]:
# Dataset Download
import seaborn as sns
import pandas as pd

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [39]:
len(df)

891

In [40]:
df.shape

(891, 15)

In [41]:
from random import random
ship_1 = df.sample(frac=0.50, random_state=1)
ship_1.shape

(446, 15)

In [42]:
ship_2 = df.drop(ship_1.index)
ship_2.shape

(445, 15)

In [43]:
df.shape

(891, 15)

In [44]:
len(ship_1) + len(ship_2)

891

# 13- Join two datasets

In [45]:
df1 = ship_1.append(ship_2)
df1.shape

C:\Users\Quantum\AppData\Local\Temp\ipykernel_15444\3264385318.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = ship_1.append(ship_2)

(891, 15)

# 14- Filtering a Dataset

In [46]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [47]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [48]:
df[(df.sex=="female")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [49]:
df.age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [50]:
df.embark_town.unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [51]:
df[(df.embark_town=="Southampton")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [52]:
df[((df.embark_town=="Southampton") |
    (df.embark_town=="Queenstown"))  & 
    (df.sex=="female")
]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [53]:
df[df.embark_town.isin(['Queenstown', 'Southampton'])].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [54]:
df[df.age < 30].shape

(384, 15)

# 15 filtering by large categories

In [55]:
df.embark_town.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [56]:
df.age.value_counts().nlargest(3)

24.0    30
22.0    27
18.0    26
Name: age, dtype: int64

In [57]:
count = df.age.value_counts()
count.nlargest(3)

24.0    30
22.0    27
18.0    26
Name: age, dtype: int64

In [58]:
count = df.who.value_counts()
count.nlargest(3)

man      537
woman    271
child     83
Name: who, dtype: int64

In [59]:
df[df.who.isin(count.nlargest(2).index)].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

# 16- Splitting a string into multiple columns

In [60]:
# import libraries
import pandas as pd

df = pd.DataFrame({'name': ['Ali', 'ahmed', 'sajjad', 'brthi'],
                    'location' : ["Lahore, PK", "berlin, GR", "dahli, IND", "nyc, USA"]})
df

     name    location
0     Ali  Lahore, PK
1   ahmed  berlin, GR
2  sajjad  dahli, IND
3   brthi    nyc, USA

In [61]:
# Spliting a column into two columns
df.name.str.split(' ').expand=True
df

     name    location
0     Ali  Lahore, PK
1   ahmed  berlin, GR
2  sajjad  dahli, IND
3   brthi    nyc, USA

In [62]:
# Adding those  split into new columns
df[["city", "country"]] = df.location.str.split(' ', expand=True)
df

     name    location     city country
0     Ali  Lahore, PK  Lahore,      PK
1   ahmed  berlin, GR  berlin,      GR
2  sajjad  dahli, IND   dahli,     IND
3   brthi    nyc, USA     nyc,     USA

# 17- Aggregrate by Multiple Groups/Functions

In [63]:
# libraries
import pandas as pd
import seaborn as sns

# import dataset
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [64]:
df.groupby('who').count()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
who,,,,,,,,,,,,,,
child,83,83,83,83,83,83,83,83,83,83,13,83,83,83
man,537,537,537,413,537,537,537,537,537,537,99,537,537,537
woman,271,271,271,218,271,271,271,269,271,271,91,269,271,271

In [65]:
df.groupby('sex').count()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
sex,,,,,,,,,,,,,,
female,314,314,261,314,314,314,312,314,314,314,97,312,314,314
male,577,577,453,577,577,577,577,577,577,577,106,577,577,577

In [66]:
len(df.groupby('who'))

3

In [67]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [68]:
df.groupby(['sex', 'pclass', 'who']).count()

                     survived  age  sibsp  parch  fare  embarked  class  \
sex    pclass who
female 1      child         3    3      3      3     3         3      3
              woman        91   82     91     91    91        89     91
       2      child        10   10     10     10    10        10     10
              woman        66   64     66     66    66        66     66
       3      child        30   30     30     30    30        30     30
              woman       114   72    114    114   114       114    114
male   1      child         3    3      3      3     3         3      3
              man         119   98    119    119   119       119    119
       2      child         9    9      9      9     9         9      9
              man          99   90     99     99    99        99     99
       3      child        28   28     28     28    28        28     28
              man         319  225    319    319   319       319    319

                     adult_male  deck  embark_town  alive  alone
sex    pclass who
female 1      child           3     3            3      3      3
              woman          91    78           89     91     91
       2      child          10     1           10     10     10
              woman          66     9           66     66     66
       3      child          30     2           30     30     30
              woman         114     4          114    114    114
male   1      child           3     3            3      3      3
              man           119    91          119    119    119
       2      child           9     3            9      9      9
              man            99     3           99     99     99
       3      child          28     1           28     28     28
              man           319     5          319    319    319

# 18 Select Specific Rows And Columns

In [69]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [70]:
# select columns
df[['sex', 'class']]

        sex   class
0      male   Third
1    female   First
2    female   Third
3    female   First
4      male   Third
..      ...     ...
886    male  Second
887  female   First
888  female   Third
889    male   First
890    male   Third

[891 rows x 2 columns]

In [71]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [72]:
#df.describe().loc[['min', '25%', '50%', '75%', 'max']]

#or
df.describe().loc['min':'max']

     survived  pclass     age  sibsp  parch      fare
min       0.0     1.0   0.420    0.0    0.0    0.0000
25%       0.0     2.0  20.125    0.0    0.0    7.9104
50%       0.0     3.0  28.000    0.0    0.0   14.4542
75%       1.0     3.0  38.000    1.0    0.0   31.0000
max       1.0     3.0  80.000    8.0    6.0  512.3292

In [73]:
df.describe().loc['min':'max', 'survived':'age']

     survived  pclass     age
min       0.0     1.0   0.420
25%       0.0     2.0  20.125
50%       0.0     3.0  28.000
75%       1.0     3.0  38.000
max       1.0     3.0  80.000

# 19- Reshape multiindex Series

In [74]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [75]:
df.survived.mean()

0.3838383838383838

In [76]:
df.groupby('sex').survived.mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [77]:
df.groupby(['sex', 'pclass']).survived.mean()

sex     pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: survived, dtype: float64

In [78]:
df.groupby(['sex', 'pclass']).survived.mean().unstack()

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# 20- Countinous to catagorical Data Conversion

In [79]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [80]:
df.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [81]:
pd.cut(df.age, bins = [0,18, 25, 80], labels=['child', 'young_adult', 'adult']).head()
df['new_age'] = pd.cut(df.age, bins = [0,18, 25, 80], labels=['child', 'young_adult', 'adult']).head()
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young_adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult

# 21- Convert One set of Values into another one

In [82]:
df.sex.head()

0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object

In [83]:
df.sex.map({'male':0, 'female': 1})
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young_adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult

In [84]:
df.embarked.head()

0    S
1    C
2    S
3    S
4    S
Name: embarked, dtype: object

In [85]:
df['embarked_num'] = df.embarked.factorize()[0]
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age,embarked_num
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young_adult,0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,1
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,0

# 22- Transpose a Wide DataFrame

In [86]:
import numpy as np
import pandas as pd

In [87]:
# Creating a new df
df = pd.DataFrame(np.random.rand(200,25), columns=list('abcdefghijklmnopqrstuvwxy'))
df.head()

,a,b,c,d,e,f,g,h,i,j,...,p,q,r,s,t,u,v,w,x,y
0,0.543245,0.627735,0.146040,0.025244,0.478527,0.984192,0.585257,0.158944,0.037096,0.898582,...,0.171249,0.957674,0.165902,0.076060,0.477980,0.258890,0.898797,0.776130,0.845884,0.551862
1,0.558173,0.144246,0.154277,0.799807,0.018622,0.724043,0.179259,0.123488,0.272460,0.711232,...,0.079828,0.885713,0.702058,0.137030,0.852756,0.227535,0.942876,0.428407,0.541733,0.376381
2,0.367056,0.089811,0.024613,0.613275,0.607160,0.671447,0.130161,0.765126,0.231423,0.753363,...,0.684140,0.164476,0.429563,0.888496,0.550394,0.119371,0.552780,0.145087,0.900521,0.241568
3,0.839182,0.414676,0.850572,0.817148,0.719515,0.726968,0.870101,0.195632,0.563737,0.650698,...,0.877122,0.820520,0.210793,0.216033,0.062581,0.906299,0.921486,0.853767,0.280667,0.315221
4,0.080933,0.950504,0.456749,0.765111,0.266512,0.402433,0.506596,0.427001,0.987332,0.758884,...,0.950000,0.999065,0.526447,0.495046,0.476697,0.141873,0.438903,0.168206,0.001808,0.474747

In [88]:
df.head(10).T

,0,1,2,3,4,5,6,7,8,9
a,0.543245,0.558173,0.367056,0.839182,0.080933,0.558860,0.808212,0.007371,0.642314,0.403565
b,0.627735,0.144246,0.089811,0.414676,0.950504,0.937234,0.789622,0.399037,0.026950,0.904493
c,0.146040,0.154277,0.024613,0.850572,0.456749,0.574063,0.701925,0.320572,0.797570,0.721700
d,0.025244,0.799807,0.613275,0.817148,0.765111,0.414308,0.009386,0.881949,0.331528,0.629370
e,0.478527,0.018622,0.607160,0.719515,0.266512,0.445716,0.648005,0.092821,0.672173,0.153097
f,0.984192,0.724043,0.671447,0.726968,0.402433,0.250703,0.837734,0.869000,0.301744,0.391699
g,0.585257,0.179259,0.130161,0.870101,0.506596,0.999404,0.887199,0.883431,0.614695,0.808817
h,0.158944,0.123488,0.765126,0.195632,0.427001,0.174924,0.315210,0.643122,0.427708,0.302938
i,0.037096,0.272460,0.231423,0.563737,0.987332,0.018293,0.142867,0.058033,0.387799,0.440325
j,0.898582,0.711232,0.753363,0.650698,0.758884,0.997706,0.395149,0.523604,0.866597,0.136017
k,0.679203,0.574310,0.349623,0.470407,0.024805,0.669377,0.404195,0.181458,0.757810,0.514743
l,0.851940,0.744872,0.458556,0.706745,0.432055,0.525914,0.817509,0.044973,0.724213,0.540772
m,0.137803,0.023052,0.136208,0.070464,0.795938,0.860379,0.716477,0.392829,0.568564,0.296688
n,0.456870,0.544407,0.081684,0.197635,0.310490,0.452184,0.444281,0.768520,0.723056,0.819033
o,0.851773,0.773969,0.098094,0.725157,0.110312,0.244204,0.438696,0.343457,0.376512,0.939086
p,0.171249,0.079828,0.684140,0.877122,0.950000,0.693940,0.694843,0.279016,0.825023,0.747417
q,0.957674,0.885713,0.164476,0.820520,0.999065,0.719975,0.787841,0.966367,0.409339,0.632427
r,0.165902,0.702058,0.429563,0.210793,0.526447,0.169997,0.751828,0.993073,0.407346,0.214835
s,0.076060,0.137030,0.888496,0.216033,0.495046,0.415550,0.635216,0.367332,0.550782,0.862801
t,0.477980,0.852756,0.550394,0.062581,0.476697,0.929982,0.169415,0.148643,0.499746,0.349115
u,0.258890,0.227535,0.119371,0.906299,0.141873,0.045619,0.060215,0.804789,0.578881,0.364040
v,0.898797,0.942876,0.552780,0.921486,0.438903,0.745596,0.740811,0.329989,0.162901,0.521956
w,0.776130,0.428407,0.145087,0.853767,0.168206,0.535604,0.250945,0.833711,0.482051,0.968150
x,0.845884,0.541733,0.900521,0.280667,0.001808,0.914966,0.139397,0.241558,0.255451,0.948556
y,0.551862,0.376381,0.241568,0.315221,0.474747,0.999188,0.149148,0.709055,0.839178,0.448153

In [89]:
df.describe()

,a,b,c,d,e,f,g,h,i,j,...,p,q,r,s,t,u,v,w,x,y
count,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,...,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000
mean,0.495991,0.496851,0.512211,0.487974,0.488540,0.490521,0.507050,0.479482,0.483166,0.482278,...,0.520679,0.490862,0.524791,0.509880,0.487226,0.461773,0.505175,0.493772,0.473497,0.496876
std,0.279369,0.291141,0.288757,0.269223,0.290868,0.285047,0.280927,0.301442,0.282227,0.289193,...,0.281089,0.290204,0.301187,0.295639,0.306098,0.293496,0.278219,0.297520,0.297123,0.290485
min,0.004978,0.010379,0.014724,0.009386,0.004275,0.001781,0.002733,0.000291,0.001080,0.003623,...,0.016473,0.004035,0.001141,0.003494,0.000234,0.002637,0.004014,0.005339,0.001278,0.005954
25%,0.272909,0.230025,0.250284,0.257357,0.244797,0.252308,0.272750,0.208192,0.245704,0.229145,...,0.285951,0.240042,0.229755,0.241191,0.214616,0.226779,0.274007,0.238624,0.236899,0.245975
50%,0.495534,0.499171,0.539174,0.452986,0.470911,0.472890,0.542699,0.482177,0.483016,0.471130,...,0.552972,0.465895,0.576278,0.504623,0.497641,0.414513,0.508051,0.468927,0.448771,0.472895
75%,0.735918,0.734757,0.769534,0.718410,0.745878,0.725739,0.735721,0.744794,0.701073,0.722650,...,0.752073,0.736418,0.762929,0.762593,0.780680,0.694054,0.740554,0.761180,0.735930,0.767975
max,0.998138,0.993757,0.997767,0.988729,0.990838,0.984192,0.999404,0.999613,0.999173,0.999885,...,0.998609,0.999065,0.999418,0.997451,0.998909,0.997139,0.996789,0.997251,0.993593,0.999283

In [90]:
df.describe().T

   count      mean       std       min       25%       50%       75%       max
a  200.0  0.495991  0.279369  0.004978  0.272909  0.495534  0.735918  0.998138
b  200.0  0.496851  0.291141  0.010379  0.230025  0.499171  0.734757  0.993757
c  200.0  0.512211  0.288757  0.014724  0.250284  0.539174  0.769534  0.997767
d  200.0  0.487974  0.269223  0.009386  0.257357  0.452986  0.718410  0.988729
e  200.0  0.488540  0.290868  0.004275  0.244797  0.470911  0.745878  0.990838
f  200.0  0.490521  0.285047  0.001781  0.252308  0.472890  0.725739  0.984192
g  200.0  0.507050  0.280927  0.002733  0.272750  0.542699  0.735721  0.999404
h  200.0  0.479482  0.301442  0.000291  0.208192  0.482177  0.744794  0.999613
i  200.0  0.483166  0.282227  0.001080  0.245704  0.483016  0.701073  0.999173
j  200.0  0.482278  0.289193  0.003623  0.229145  0.471130  0.722650  0.999885
k  200.0  0.513872  0.288190  0.013105  0.262622  0.518400  0.758034  0.994344
l  200.0  0.479102  0.277156  0.003163  0.243293  0.462531  0.707836  0.998637
m  200.0  0.482664  0.289904  0.006027  0.215783  0.453677  0.756432  0.998106
n  200.0  0.524533  0.276508  0.007575  0.300107  0.516551  0.777630  0.999625
o  200.0  0.514912  0.281030  0.012162  0.286356  0.522675  0.756531  0.987208
p  200.0  0.520679  0.281089  0.016473  0.285951  0.552972  0.752073  0.998609
q  200.0  0.490862  0.290204  0.004035  0.240042  0.465895  0.736418  0.999065
r  200.0  0.524791  0.301187  0.001141  0.229755  0.576278  0.762929  0.999418
s  200.0  0.509880  0.295639  0.003494  0.241191  0.504623  0.762593  0.997451
t  200.0  0.487226  0.306098  0.000234  0.214616  0.497641  0.780680  0.998909
u  200.0  0.461773  0.293496  0.002637  0.226779  0.414513  0.694054  0.997139
v  200.0  0.505175  0.278219  0.004014  0.274007  0.508051  0.740554  0.996789
w  200.0  0.493772  0.297520  0.005339  0.238624  0.468927  0.761180  0.997251
x  200.0  0.473497  0.297123  0.001278  0.236899  0.448771  0.735930  0.993593
y  200.0  0.496876  0.290485  0.005954  0.245975  0.472895  0.767975  0.999283

# 23- Reshaping a Dataframe

In [91]:
fasla = pd.DataFrame([['12345', 100,200, 300], ['34567', 400, 500, 600], ['67890', 700, 800, 900]],
                            columns=['zip', 'factory', 'warehouse', 'retail'])
fasla.head()

     zip  factory  warehouse  retail
0  12345      100        200     300
1  34567      400        500     600
2  67890      700        800     900

In [92]:
fasla.head().T

               0      1      2
zip        12345  34567  67890
factory      100    400    700
warehouse    200    500    800
retail       300    600    900

In [93]:
fasla2 = pd.DataFrame([[1, '12345', 'factory'], [2, '34567', 'warehouse']],
                            columns=['user_id', 'zip', 'location_type'])
fasla2.head()

   user_id    zip location_type
0        1  12345       factory
1        2  34567     warehouse

In [94]:
fasla_long = fasla.melt(id_vars='zip', var_name='location_type', value_name='distance')
fasla_long.head()

     zip location_type  distance
0  12345       factory       100
1  34567       factory       400
2  67890       factory       700
3  12345     warehouse       200
4  34567     warehouse       500

In [96]:
sns.barplot (x='zip', y='distance', hue='location_type' data=fasla_long)

SyntaxError: invalid syntax (4006779793.py, line 1)